[
    {
      "id": "01",
      "category_id": "01",
      "hours": "120Hours",
      "title": "Become a HTML & CSS Expert",
      "price": "40",
      "author": {
        "name": "Kawser",
        "img": "https://scontent.fdac7-1.fna.fbcdn.net/v/t39.30808-6/279550183_2844155465877148_5886764568754352422_n.jpg?_nc_cat=110&ccb=1-7&_nc_sid=174925&_nc_eui2=AeHWWKUdosmsupgp6zSUSipRn44_NeLSYIWfjj814tJgheDx-ip-gom9ZwMwxouQK2X0PpdSXFir17fN08jm5MR2&_nc_ohc=96UpxznebgYAX8q6w_v&_nc_ht=scontent.fdac7-1.fna&oh=00_AfCQgZdHxExc7iPXGdRfv2ytWLej_P5R9kqabWJGHU9rkQ&oe=635F32C9"
      },
      "image_url": "https://www.filepicker.io/api/file/eYA6E8L3TiGl0GxpQoS6",
      "details": "Learn What It Takes to Code Dynamic, Professional Websites and Web Apps From The Comfort of Your Own Home Do you ever browse the internet wondering how your favorite websites were built? Facebook, Twitter, Amazon—they were all created by people who at one point in time didn’t know anything about coding. How did they obtain this knowledge? In this comprehensive course, I’m going to show you everything you need to know so that you can follow in these people’s footsteps. You’re going to learn how to code AND you’re going to become a certified professional from a recognized international trainer. And best of all, you’re going to have fun doing it. You Don’t Have to Be a Genius or a Mathematical Wizard. So many people believe that you must have a special ‘gift’ to create professional-quality, dynamic websites/web apps. I’m here to tell you once and for all that this is false. All you need to have is the desire to learn and the ability to follow instructions—that’s it! Our course starts teaching basic coding principles and develops your coding skills in a variety of languages from beginner through to advanced. Here it is, once and for all, a complete guide that will take you from novice to web developer. Skip Hours of Frustration and Thousands of Wasted Dollars and Become 100% Certified The internet has changed the rules of doing business. More and more companies are migrating online while many new, never before seen businesses are created every day thanks to the power of this phenomenon. You know what that means? Higher demand for people just like you! But the problem for these businesses is that while demand is high, supply is short. Please don’t let a lack of knowledge stop you from having the career of your dreams, not when the knowledge you need is right here and is extremely affordable. Don’t worry, you won’t need to buy any additional courses, it’s all here. No need to spend four years and over $15,000 per year in college tuition either—it really is all here. From HTML to CSS then to Javascript and finally PHP, you will learn how to Become a Certified Web Developer. It Doesn’t Matter Where You’re Starting From...You Can Do It! Maybe: ● You’re planning on studying coding at college and want to build a rock-solid foundation so that you have a huge head start before your course begins? ● You’re dissatisfied with your current job and want to learn exactly what it takes to become a fully qualified web developer? ● You’re currently working in IT but want to expand your skill base so that you’re 100% up to date with the latest developments in web technology? ● You want to develop mobile apps or websites on the side to create some additional income while retaining your current job? Learn Skills That Will Benefit You for The Rest of Your Life - Imagine being able to create a web app that is downloaded by millions of paying customers—or a website that’s visited by people from all seven continents. - Imagine the limitless opportunities that having these programming skills will give you. - Imagine working in a field that challenges you and allows you to express yourself freely every day. - Imagine being paid extremely well for developing products and services that can help change people’s lives. Stop imagining and take action! It’s time to start your journey. Your future is waiting for you... Four Certifications in One The unique Certified Web Development Professional credential will provide proof that you have mastered the fundamental skills needed by new web developers. You'll have a full understanding of HTML5, the language used to structure web sites and many mobile applications that you use every day. From there, you'll move on to Javascript-- the language of interaction on the web. The use of Javascript is growing at a lightning pace and it's been called - the most important language to learn today. by multiple experts. Each language carries its own individual Specialist Designation for which you earn a certificate, the privilege of using the specialist credential badge, and a personal online transcript page that shows your designations, certification, and accomplishments. Prepare for Valuable Industry Certifications This course is specially designed to prepare you for the  Web Development Professional Certification from LearnToProgram, Inc. This certification will allow you to prove that you have achieved competencies in HTML, CSS, Javascript, and PHP/MySQL-- everything you need to create basic web applications. New for 2019:  No exams are required to earn your certifications.  Complete and submit all the lab activities for the course program and you'll earn your new certifications! Certified Web Developers will receive: A printable certificate indicating your new certification that you can present to employers or prospects A letter explaining the certification and its value to a prospective employer. The letter will state exactly what mastery the certification represents Authorization to use the LearnToProgram Certified Web Developer Badge on your website and marketing materials Automatic linkage to your LinkedIn account to display your certification"
    },
    {
      "id": "02",
      "category_id": "02",
      "hours": "250Hours",
      "title": "Ultimate Web Designer & Web Developer",
      "price": "85",
      "author": {
        "name": "Kawser",
        "img": "https://scontent.fdac7-1.fna.fbcdn.net/v/t39.30808-6/279550183_2844155465877148_5886764568754352422_n.jpg?_nc_cat=110&ccb=1-7&_nc_sid=174925&_nc_eui2=AeHWWKUdosmsupgp6zSUSipRn44_NeLSYIWfjj814tJgheDx-ip-gom9ZwMwxouQK2X0PpdSXFir17fN08jm5MR2&_nc_ohc=96UpxznebgYAX8q6w_v&_nc_ht=scontent.fdac7-1.fna&oh=00_AfCQgZdHxExc7iPXGdRfv2ytWLej_P5R9kqabWJGHU9rkQ&oe=635F32C9"
      },
      "image_url": "https://i.ytimg.com/vi/B-ytMSuwbf8/maxresdefault.jpg",
      "details": "This course by Brad Hussey is the go-to, most comprehensive, A to Z web design, web development and career-building course that will kickstart your progress by focusing on what you need to learn, and avoiding the unnecessary details. - - - Do you want to learn web design and front-end development? Do you need a career change but don't know where to start? Are you a total beginner looking for an all-in-one Web Design, Web Development and Career Building course that takes you step-by-step through all of the necessary skills you need to know to start working professionally as a web designer or developer? Are you a programmer or web developer looking to improve your design skills, so your designer colleagues can stop making fun of your bad designs? Or maybe you're a graphic designer looking to learn how to code, so your programmer colleagues can stop laughing at your sad coding attempts? Have you wasted time & hard earned money watching boring, drawn-out and overwhelming web design and web development courses that promise to make you a complete master of every possible discipline known to man? Look no further! There's no better place to learn web design and become a skilled front-end developer than with The Ultimate Web Designer & Front-End Developer Course by Brad Hussey. This course will teach you everything you need to know (and none of what you don't need to know). With more than 80,000 happy students, this Udemy course is trusted by beginners and experts alike. Brad Hussey – an experienced web designer and front-end developer – will teach you everything from web design basics to creating beautiful user interfaces with HTML and CSS. You'll also learn how to develop dynamic websites with JavaScript, PHP, MySQL and more. And that's just the beginning! You'll also learn about creating responsive websites and user interfaces that look great on any device by using popular frameworks like Bootstrap and Tailwind CSS. By the end of this course, you'll have the skills and knowledge you need to start your own successful web design career, whether you want to land a job as a web designer or start taking on clients as a freelance web designer. So if you're ready to become a web designer in 2022? Join the course today! - - - What can you expect from this course? You will go from knowing nothing to creating over 23 impressive designs, websites, and applications — all with step-by-step instruction from one of the most entertaining, engaging and passionate web design educators on the web today! We'll start by learning Visual & Web Design, how to use Adobe Photoshop, and how to sketch professional wireframes. We'll then learn to code with HTML5, CSS3, Javascript and jQuery. At this point, you'll be able to code custom websites, animations and web applications by yourself. Once we're cool with the front-end languages, we'll then melt our brain-bits with highly advanced skills like Responsive Websites, PHP, MySQL, WordPress and custom WordPress plugin development. You'll then have the ability to build responsive, dynamic websites and blogs, basic eCommerce sites and online stores, and have a professional understanding of all aspects of web design & development. After you've learned everything from Design to Development, you'll be taken through a hands-on career section fully-loaded with valuable tips, resources, and real-world guidance to help you start your career — whether you want to work-from-home as a freelancer or secure a full-time studio gig at a design agency. - - - What are some of the projects you will build? In addition to working on your very own self-directed project that challenges you to use your new skills as you learn, you'll be building over 23 custom projects throughout the course: In Photoshop: Design a custom web graphic Design a custom business card Design a modern landing page Re-design a blog In HTML5 & CSS3: Multiple custom websites & web pages Code the Google landing page Orbiting planets animation in CSS3 A responsive Startup Style website In Javascript & jQuery A working Tip Calculator An actual race car game A To-Do List web application In PHP & MySQL Dynamic websites An impressive application that fixes clickbait headlines Working login and logout sequence A profile page that pulls information from a database Robust Client Address Book application that manages your clients' information Custom WordPress plugin In AngularJS Real Estate Listing Single-Page Application In WordPress Plugins Custom, real-world survey plugin ...and much more"
    },
    {
      "id": "03",
      "category_id": "03",
      "hours": "200Hours",
      "title": "Java Programming for Complete Beginners",
      "price": "120",
      "author": {
        "name": "Kawser",
        "img": "https://scontent.fdac7-1.fna.fbcdn.net/v/t39.30808-6/279550183_2844155465877148_5886764568754352422_n.jpg?_nc_cat=110&ccb=1-7&_nc_sid=174925&_nc_eui2=AeHWWKUdosmsupgp6zSUSipRn44_NeLSYIWfjj814tJgheDx-ip-gom9ZwMwxouQK2X0PpdSXFir17fN08jm5MR2&_nc_ohc=96UpxznebgYAX8q6w_v&_nc_ht=scontent.fdac7-1.fna&oh=00_AfCQgZdHxExc7iPXGdRfv2ytWLej_P5R9kqabWJGHU9rkQ&oe=635F32C9"
      },
      "image_url": "https://ultimatecourses.com/assets/share/courses/javascript-51f65a000ac5f98e707cac1fbdf54c209529157ff399544518dba9c47b1f31da.png",
      "details": "Java is one of the most popular programming languages. Java offers both object-oriented and functional programming features. We take a hands-on approach using a combination of JShell and Eclipse as an IDE to illustrate more than 200 Java Coding Exercises, Puzzles, and Code Examples. This course assumes no previous ( beginner ) programming or Java experience. If you’ve never programmed a computer before, or if you already have experience with another programming language and want to quickly learn Java, this is a perfect course for you. In more than 250 Steps, we explore the most important Core Java Programming Language Features Basics of Java Programming - Expressions, Variables, and Printing Output Java Operators - Java Assignment Operator, Relational and Logical Operators, Short Circuit Operators Java Conditionals and If Statement Methods - Parameters, Arguments, and Return Values Object-Oriented Programming - Class, Object, State, and Behavior Basics of OOPS - Encapsulation, Abstraction, Inheritance, and Polymorphism Basics about Java Data Types - Casting, Operators, and More Java Built-in Classes - BigDecimal, String, Java Wrapper Classes Conditionals with Java - If Else Statement, Nested If Else, Java Switch Statement, Java Ternary Operator Loops - For Loop, While Loop in Java, Do While Loop, Break and Continue Immutability of Java Wrapper Classes, String and BigDecimal Java Dates - Introduction to LocalDate, LocalTime and LocalDateTime Java Array and ArrayList - Java String Arrays, Arrays of Objects, Primitive Data Types, toString and Exceptions Introduction to Variable Arguments Basics of Designing a Class - Class, Object, State and Behavior. Deciding State and Constructors. Understanding Object Composition and Inheritance Java Abstract Class and Interfaces. Introduction to Polymorphism. Java Collections - List Interface(ArrayList, LinkedList and Vector), Set Interface (HashSet, LinkedHashSet and TreeSet), Queue Interface (PriorityQueue) and Map Interface (HashMap, HashTable, LinkedHashMap and TreeMap() - Compare, Contrast and Choose Generics - Why do we need Generics? Restrictions with extends and Generic Methods, WildCards - Upper Bound and Lower Bound. Functional Programming - Lambda Expression, Stream and Operations on a Stream (Intermediate Operations - Sort, Distinct, Filter, Map and Terminal Operations - max, min, collect to List), Functional Interfaces - Predicate Interface, Consumer Interface, Function Interface for Mapping, Method References - static and instance methods Introduction to Threads and MultiThreading - Need for Threads Implementing Threads - Extending Thread Class and Implementing Runnable Interface States of a Thread and Communication between Threads Introduction to Executor Service - Customizing the number of Active Threads. Returning a Future, invokeAll, and invokeAny Introduction to Exception Handling - Your Thought Process during Exception Handling. try, catch, and finally. Exception Hierarchy - Checked Exceptions vs Unchecked Exceptions. Throwing an Exception. Creating and Throwing a Custom Exception - CurrenciesDoNotMatchException. Try with Resources - New Feature in Java 7. List files and folders in Directory with Files list method, File walk method and find methods. Read and write from a File. Start Learning Now. Hit the Enroll Button!"
    },
    {
      "id": "04",
      "category_id": "04",
      "hours": "280Hours",
      "title": "Complete React Developer in 2022",
      "price": "150",
      "author": {
        "name": "Kawser",
        "img": "https://scontent.fdac7-1.fna.fbcdn.net/v/t39.30808-6/279550183_2844155465877148_5886764568754352422_n.jpg?_nc_cat=110&ccb=1-7&_nc_sid=174925&_nc_eui2=AeHWWKUdosmsupgp6zSUSipRn44_NeLSYIWfjj814tJgheDx-ip-gom9ZwMwxouQK2X0PpdSXFir17fN08jm5MR2&_nc_ohc=96UpxznebgYAX8q6w_v&_nc_ht=scontent.fdac7-1.fna&oh=00_AfCQgZdHxExc7iPXGdRfv2ytWLej_P5R9kqabWJGHU9rkQ&oe=635F32C9"
      },
      "image_url": "https://process.fs.teachablecdn.com/ADNupMnWyR7kCWRvm76Laz/resize=width:705/https://www.filepicker.io/api/file/fGWjtyQtG4JE7UXgaPAN",
      "details": "Just FULLY updated and re-recorded with all new React features for 2022 (React v18)! Join a live online community of over 600,000+ developers and a course taught by industry experts that have actually worked both in Silicon Valley and Toronto with React.js. Using the latest version of React (React 18), this course is focused on efficiency. Never spend time on confusing, out of date, incomplete tutorials anymore. Graduates of Andrei’s courses are now working at Google, Tesla, Amazon, Apple, IBM, JP Morgan, Facebook, + other top tech companies. We guarantee you this is the most comprehensive online resource on React. This project based course will introduce you to all of the modern toolchain of a React developer in 2022. Along the way, we will build a massive e-commerce application similar to Shopify using React, Redux, React Hooks, React Suspense, React Router, GraphQL, Context API, Firebase, Redux-Saga, Stripe + more. This is going to be a full stack app (MERN stack), using Firebase. The curriculum is going to be very hands on as we walk you from start to finish of releasing a professional React project all the way into production. We will start from the very beginning by teaching you React Basics and then going into advanced topics so you can make good decisions on architecture and tools on any of your future ReactJS projects. All code is going to be provided step by step and even if you don’t like to code along, you will get access to the the full master project code so anyone signed up for the course will have their own project to put on their portfolio right away. The topics covered will be: - React Basics - React Router - Redux - Redux Saga - Asynchronous Redux - React Hooks - Context API - React Suspense + React Lazy - Firebase - Stripe API - Styled-Components - GraphQL - Apollo - PWAs - React Performance - React Design Patterns - Testing with Jest, Enzyme and Snapshot testing - React Best Practices - Persistance + Session Storage - State Normalization + more Wait wait… I know what you’re thinking. Why aren’t we building 10+ projects? Well, here’s the truth: Most courses teach you React and do just that. They show you how to get started, build 10 projects that are simple and easy to build in a day, and just add some CSS to make them look fancy. In real life though, you’re not building silly applications. When you apply to jobs, nobody is going to care that you built a really pretty To Do app. Employers want to see you build large apps that can scale, that have good architecture, and that can be deployed to production. Let me tell you 3 reasons why this course is different from any other React tutorial online: 1. You will build the biggest project you will see in any course. This type of project would take you months to implement yourself. 2. This course is taught by 2 instructors that have actually worked for some of the biggest tech firms using React in production. Yihua has been working on some of the biggest e-commerce websites that you have definitely heard of and probably have shopped at. Andrei has worked on enterprise level React applications for large IPOed tech firms in Silicon Valley as well as Toronto. By having both of them teach, you get to see different perspective and learn from 2 senior developers as if you are working at a company together. 3. We learn principles that are important beyond just what you learn as a beginner. Using the instructor's experiences you learn about design patterns, how to architect your app, organize your code, structure your folders, and how to think about performance. Let’s just say we don’t shy away from the advanced topics. This course is not about making you just code along without understanding the principles so that when you are done with the course you don’t know what to do other than watch another tutorial. No! This course will push you and challenge you to go from an absolute beginner in React to someone that is in the top 10% of React developers. Taught By: Andrei Neagoie is the instructor of the highest rated Development courses on Udemy as well as one of the fastest growing. His graduates have moved on to work for some of the biggest tech companies around the world like Apple, Google, Amazon, JP Morgan, IBM, UNIQLO etc... He has been working as a senior software developer in Silicon Valley and Toronto for many years, and is now taking all that he has learned, to teach programming skills and to help you discover the amazing career opportunities that being a developer allows in life. Having been a self taught programmer, he understands that there is an overwhelming number of online courses, tutorials and books that are overly verbose and inadequate at teaching proper skills. Most people feel paralyzed and don't know where to start when learning a complex subject matter, or even worse, most people don't have $20,000 to spend on a coding bootcamp. Programming skills should be affordable and open to all. An education material should teach real life skills that are current and they should not waste a student's valuable time.   Having learned important lessons from working for Fortune 500 companies, tech startups, to even founding his own business, he is now dedicating 100% of his time to teaching others valuable software development skills in order to take control of their life and work in an exciting industry with infinite possibilities. Andrei promises you that there are no other courses out there as comprehensive and as well explained. He believes that in order to learn anything of value, you need to start with the foundation and develop the roots of the tree. Only from there will you be able to learn concepts and specific skills(leaves) that connect to the foundation. Learning becomes exponential when structured in this way. Taking his experience in educational psychology and coding, Andrei's courses will take you on an understanding of complex subjects that you never thought would be possible. See you inside the courses!"
    },
    {
      "id": "05",
      "category_id": "05",
      "hours": "250Hours",
      "title": "Complete NodeJS Developer in 2022 ",
      "price": "90",
      "author": {
        "name": "Kawser",
        "img": "https://scontent.fdac7-1.fna.fbcdn.net/v/t39.30808-6/279550183_2844155465877148_5886764568754352422_n.jpg?_nc_cat=110&ccb=1-7&_nc_sid=174925&_nc_eui2=AeHWWKUdosmsupgp6zSUSipRn44_NeLSYIWfjj814tJgheDx-ip-gom9ZwMwxouQK2X0PpdSXFir17fN08jm5MR2&_nc_ohc=96UpxznebgYAX8q6w_v&_nc_ht=scontent.fdac7-1.fna&oh=00_AfCQgZdHxExc7iPXGdRfv2ytWLej_P5R9kqabWJGHU9rkQ&oe=635F32C9"
      },
      "image_url": "https://cdn.educba.com/academy/wp-content/uploads/2019/01/Career-in-Node_js-1.jpg",
      "details": "Just released with all new NodeJS best practices and trends for 2022! Join a live online community of over 600,000+ developers and a course taught by industry experts that have actually worked both in Silicon Valley and Toronto with Node.js. Using the latest version of Node, this course is focused on efficiency and turning you into a Back End or Fullstack developer. Never spend time on confusing, out of date, incomplete tutorials anymore! Graduates of Andrei’s courses are now working at Google, Tesla, Amazon, Apple, IBM, JP Morgan, Facebook, + other top tech companies for a reason. We guarantee you this is the most comprehensive online resource on NodeJS. This project based course will introduce you to all of the modern toolchain of a Node JS developer in 2022. Along the way, we will build a massive NASA Space launch application using Node.js, Express Framework, RESTful APIs, GraphQL, and much more! This is going to be a Fullstack MERN app. We will also build many other mini projects along the way so you feel confident deploying any Node.js project to production in the future by yourself! All code is going to be provided step by step and even if you don’t like to code along, you will get access to all the code from the projects we build so anyone signed up for the course will have their own project to put on their portfolio right away. The curriculum is going to be very hands on as we walk you from start to finish of releasing a professional (performant and secure) Node.js project all the way into production. We will start from the very beginning by teaching you Node basics and then going into advanced topics so you can make good decisions on architecture and tools on any of your future NodeJS projects. The goal is to turn you into a senior backend developer! Finally, this course will be constantly evolving and updating as the landscape changes. Just as the Node ecosystem evolves, we want this course to be constantly updated with lectures and resource for you to come back to, in order to find the latest Node best practices anytime in the future. Here is what the course will cover: 1. Foundations Focus on Node internals Libuv, threads, processes, event loop Asynchronous programming Node vs PHP vs Python Observer Design Pattern Event Emitters 2. Module System The require Function Creating Your Own Modules CommonJS vs ECMAScript (ES6) modules Module Caching Using index.js 3. Package Management NPM: The Node Package Manager Creating Your Own Packages Package And the NPM Registry Third Party Modules The node_modules Folder Semantic Versioning package-lock.json And Versioning Vulnerabilities in Dependencies 4. File I/O: Planets Project Exploring Exoplanets With Node Exploring Kepler Space Telescope Data Working With Streams Streaming Large Data Files Parsing Our Planets Data Working With CSV Files Finding Habitable Planets 5. Web Servers What is a Web Server? HTTP Responses and Requests HTTP APIs and Routing, Parameterized URLs Same Origin Policy, CORS Requests and Responses as Streams 6. Express.js Express vs Next.js vs Koa Route Parameters Model View Controller (MVC) pattern Postman and Insomnia Development Dependencies Middleware Logging Middleware Example / Writing Our Own Middleware POST Requests in Express MVC In Express Express Routers RESTful APIs CRUD Sending Files Serving Websites With Node Templating Engines 7. NodeJS NASA Project Architecture diagrams on LucidChart GET, POST, DELETE routes. Serving React.js Applications in Express CORS middleware Models vs Controllers vs Routers Loading Data On Startup Automating Full Stack Applications With NPM Serving React Front End (in Production) Logging Requests with Morgan Serving Applications With Client Side Routing Building A Data Access Layer Integrating with Frontend, Top Down Approach, Bottom Up Approach Updating Our Architecture 8. Testing APIs Unit tests vs API tests vs UI tests Testing Node APIs with Jest and Supertest 9. Improving Node Performance Example app which blocks event loop + real life blocking functions Node Cluster Module theory + in action Clustering in the real world Load balancing PM2 theory + in action Managing Live Clusters with PM2 Zero Downtime Restarts Improving Performance of NASA Project Stateless APIs Node Worker Threads 10. Databases Using MongoDB to add persistence to NASA Project Big focus on NoSQL vs SQL, PostgreSQL vs MongoDB, when to use both including Trends, Object-Relational Mismatch, ACID, References, Schemas. Schema-less vs Schemas MongoDB Atlas Horizontally Scaling Databases Mongoose Mongoose Models vs MVC Models ObjectIDs in MongoDB Pagination Choosing A Database For Our NASA API 11. Working With REST APIs Demonstrate integrating with a REST API by working with SpaceX API Versioning REST APIs Running Search Queries SpaceX Launch Data Mapping API Data to Our Database Using Paginated APIs Adding Pagination To Our API 12. Authentication Focus on Security first principles with JWT, cookies, CSRF Servers with HTTPS and SSL / TLS Helmet.js Working With Auth0 13. Deployment and CI/CD Focus on building out a simple CI pipeline for NASA Project on GitHub What is CI vs CD? Automated tests Dynamic configuration with secrets 14. Node Production and the Cloud (AWS) Deploy to production with Docker to Amazon EC2 Virtual Machines Serverless vs Containers Docker files Managing Docker Containers and Images Working With SSH Production Deployment with PM2 and Mongo Atlas 15. GraphQL GraphQL vs REST Building a GraphQL API 16. Sockets (WebSockets, Socket io) Sockets overview Sockets vs polling WebSockets (vs Socket io) Socket io Client and Server APIs Broadcasting Events Build out Full Stack Multiplayer Pong with Sockets Implementing Pong Game Logic Using Socket io With Express.js Namespaces and Rooms 17~20.  Bonus Sections on Deno, Advanced Asynchronous JavaScript, SQL, and TypeScript! This course is not about making you just code along without understanding the principles so that when you are done with the course you don’t know what to do other than watch another tutorial. No! This course will push you and challenge you to go from an absolute beginner in NodeJS to someone that is in the top 10% of NodeJS backend developers."
    },
    {
      "id": "06",
      "category_id": "06",
      "hours": "230Hours",
      "title": "The Complete SQL Bootcamp 2022",
      "price": "75",
      "author": {
        "name": "Kawser",
        "img": "https://scontent.fdac7-1.fna.fbcdn.net/v/t39.30808-6/279550183_2844155465877148_5886764568754352422_n.jpg?_nc_cat=110&ccb=1-7&_nc_sid=174925&_nc_eui2=AeHWWKUdosmsupgp6zSUSipRn44_NeLSYIWfjj814tJgheDx-ip-gom9ZwMwxouQK2X0PpdSXFir17fN08jm5MR2&_nc_ohc=96UpxznebgYAX8q6w_v&_nc_ht=scontent.fdac7-1.fna&oh=00_AfCQgZdHxExc7iPXGdRfv2ytWLej_P5R9kqabWJGHU9rkQ&oe=635F32C9"
      },
      "image_url": "https://i.ytimg.com/vi/mhsp1SSiugk/maxresdefault.jpg",
      "details": "Learn how to use SQL quickly and effectively with this course! You'll learn how to read and write complex queries to a database using one of the most in demand skills - PostgreSQL. These skills are also applicable to any other major SQL database, such as MySQL, Microsoft SQL Server, Amazon Redshift, Oracle, and much more. Learning SQL is one of the fastest ways to improve your career prospects as it is one of the most in demand tech skills! In this course you'll learn quickly and receive challenges and tests along the way to improve your understanding! In this course you will learn everything you need to become a SQL Pro! Including: Get started with PostgreSQL and PgAdmin , two of the world's most popular SQL tools Learn he basics of SQL syntax Analyzing data using aggregate functions with GROUP BY commands Running advanced queries with string operations and comparison operations Learn to use logical operators to add logic flow to your SQL queries Learn common SQL JOIN commands Learn to create tables and databases with constraints on data entries Learn to use Python to further advanced your SQL skills and much, much more! This is course that put's you in control, having you set up and restore databases right at the start of the course, instead of watching someone else code. Every section comes with fresh challenge questions and tasks, modeled after real world tasks and situations. I've spent years as an instructor both online and in-person at Fortune 500 companies, and this course is built to combine the best of both worlds, allowing you to learn at your own pace through an interactive environment. You will start with the basics and soon find yourself working with advanced commands, dealing with timestamp data and variable character information like a seasoned professional. SQL is one of the most in demand skills for business analysts, data scientists, and anyone who finds themselves working with data! Upgrade your skill set quickly and add SQL to your resume by joining today! I'll see you inside the course! Check out the free preview videos for more information!"
    }
]
